title: March 2022 FBI FLASH RagnarLocker Ransomware IOCs
id: d8662cc3-f9aa-46b9-ae6b-6e7d49781560
status: experimental
description: 'Detects IOCs associated with RagnarLocker ransomware deployment, based on FBI's March 2022 FLASH report.'
author: Michael Morgan, Booz Allen's Adversary Informed Defense Team // bah_aid@bah.com
references:
  - https://www.ic3.gov/Media/News/2022/220307.pdf
  - https://www.cisa.gov/uscert/ncas/current-activity/2022/03/08/fbi-releases-indicators-compromise-ragnarlocker-ransomware
date: 2022/03/11
modified: 
logsource:
  product: zeek
  service: conn
detection:
  selection:
     id_resp_h|contains: 
    - '185.138.164.18'
    - '185.172.129.215'
    - '45.144.29.2'
    - '23.106.122.192' 
    - '45.90.59.131'
    - '149.28.200.140'
    - '193.42.36.53'
    - '45.63.89.250'
    - '190.211.254.181'
    - '142.44.236.38'
    - '37.120.238.10'
    - '95.216.196.181'
    - '162.55.38.44'
    - '116.203.132.32'
    - '49.12.212.231'
    - '193.42.39.10'
    - '193.111.153.24'
    - '178.32.222.98'
    - '23.227.202.72'
    - '159.89.95.163'
    - '50.201.185.11'
    - '47.35.60.92'
    - '108.26.193.165'
    - '108.56.142.135'
    - '198.12.81.56'
    - '198.12.127.199'
    - '45.91.93.75'
    - '217.25.93.106'
    - '45.146.164.193'
    - '89.40.10.25'
    - '5.45.65.52'
    - '79.141.160.43'
  condition: selection 
falsepositives:
  - reassigned ip space
level: medium
tags:
  - attack.t1090
  - attack.t1105
